
public class Ex1 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		System.out.println("1")
		System.out.println("2");
		System.out.println("3");
		System.out.println("4");
		System.out.println("5");
		
	}
}
}

/*권장 사항
1. 의미있는 단어 사용
2. 클래스, 인터페이스 등은 첫글자 대문자 사용
   변수, 매서드 등은 첫글자 소문자 사용
3. 두 단어 이상의 조합은 Camel-case(낙타 표기법)
   (두번째 단어부터 첫글자를 대문자로 표기 ex)myName, maxSpeed
4. 상수는 모두 대문자로 표기하며
   단어와 단어 사이 _ 로 구분함 ex) MAX_SPEED
   */

/*주석(comment)
비 실행문으로, 자바 프로그램 컴파일 대상에서 제외되는 문장 ( 실행되지 않음)
주 용도: 프로그램 코드에 대한 설명문 등을 작성
1. 라인 주석 = 단일 주석 - 한줄 주석 => // 기호 사용
   // 기호 뒤의 문장 한 줄을 주석으로 처리
   주석 설정 단축키 : 주석 처리할 문장에 커서를 위치한 후
   컨트롤 +쉬프트 + c 또는 컨트롤 + /
   주석 해제 단축키도 설정과 동일함
   여러 줄 주석 처리에도 활용가능
2. 범위 주석 => 블록 주석 => /* */
/*  주석 기호 사이에 오는 모든 문장들을 주석 처리
    여러 줄에 걸쳐서 모든 범위를 지정할 수 도 있다.
    주석 설정 단축키 : 주석 처리할 블록을 정확히 지정한 후 
                   컨트롤 + 쉬프트 + /
    주석 해제 단축키 : 주석 처리할 블록을 정확히 지정한 후
                   컨트롤 + 쉬프트 \
                   */
}